{
  "backend/main.mo": "Main Motoko canister handling user profiles, homework, timetable entries, and quiz progress with access control and custom Day and TimeSlot modules.",
  "feature_evidence.json": "Feature evidence report mapping sparkle-related UI features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing concise summaries of many frontend files for reference in build planning.",
  "frontend/index.css": "Base Tailwind setup defining CSS variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "HTML entrypoint containing root div and script loader for the frontend app.",
  "frontend/src/App.tsx": "Initializes TanStack Router and QueryClient and wraps the app in the SceneProvider.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting users for their display name and saving it via backend mutation.",
  "frontend/src/components/common/BigActionButton.tsx": "Large styled button component supporting icons, variants, and disabled state.",
  "frontend/src/components/common/EmptyState.tsx": "Displays an empty-state message with icon, title, and description.",
  "frontend/src/components/common/ErrorState.tsx": "Error UI component with icon, message, and optional retry button.",
  "frontend/src/components/common/LoadingState.tsx": "Centered loading spinner with optional message text.",
  "frontend/src/components/common/NavCardButton.tsx": "Clickable navigation card with icon, label, and luxury-themed styling.",
  "frontend/src/components/common/ScreenHeader.tsx": "Header bar with optional back/home buttons and sparkle-styled title.",
  "frontend/src/components/common/SparkleOverlay.tsx": "Provides layered sparkle and glitter overlays with optional corner accents, respecting reduced-motion settings.",
  "frontend/src/components/scene/ScenePicker.tsx": "Renders a selectable grid of scene cards and updates the active scene in context.",
  "frontend/src/components/scene/SceneThumbnail.tsx": "Displays a scene image with graceful fallback UI on load failure.",
  "frontend/src/contexts/SceneContext.tsx": "Manages the selected scene with persistence, validation, and utilities for resolving scene image URLs.",
  "frontend/src/data/quizData.ts": "Defines a quiz question interface and provides a list of simple quiz questions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced-motion preference via a media query.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend CRUD operations for user profiles, homework, and timetable entries using react-query.",
  "frontend/src/hooks/useSceneBackground.ts": "Preloads the selected scene's background image and returns either the image style or a fallback color.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, plus utility classes for backgrounds and gradients.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider and renders the root App component.",
  "frontend/src/pages/games/BoyGame1Screen.tsx": "Implements a math quiz game where kids solve addition problems with scoring and feedback.",
  "frontend/src/pages/games/BoyGame2Screen.tsx": "Runs a shape-matching game where players identify and click the correct shape to earn points.",
  "frontend/src/pages/games/GirlyGame1Screen.tsx": "Provides a word‑spelling game where players build target words letter by letter to increase score.",
  "frontend/src/pages/games/GirlyGame2Screen.tsx": "Implements a memory‑matching game with emoji cards, tracking moves and completion state.",
  "frontend/src/pages/GamesHubScreen.tsx": "Displays a themed game selection screen with scene backgrounds and category cards for different games.",
  "frontend/src/pages/HomeScreen.tsx": "Home dashboard showing user greeting, navigation cards, authentication checks, and profile setup handling.",
  "frontend/src/pages/HomeworkScreen.tsx": "CRUD interface for homework items with add, edit, delete, and completion toggling using React Query.",
  "frontend/src/pages/LoginScreen.tsx": "Login UI using Internet Identity with loading states, error handling, and a decorative card layout.",
  "frontend/src/pages/QuizScreen.tsx": "Interactive quiz flow with intro, question answering, results saving, and animated themed UI.",
  "frontend/src/pages/TimetableScreen.tsx": "Displays and manages timetable entries with create, update, and delete dialogs, grouping entries by day and requiring authentication.",
  "frontend/src/pages/WelcomeScreen.tsx": "Shows the app welcome screen with branding and a button that navigates to login.",
  "frontend/src/routeTree.tsx": "Defines the app’s full TanStack Router route tree, mapping paths to screen components including home, login, homework, timetable, games, and individual game routes.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including persistence and hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, shadows, radii, and plugin integrations for a stylized theme.",
  "project_state.json": "Describes the project’s design goals, known issues, and required sparkly luxury visual features, including needed image assets and feature requests."
}